EmbeddedSystemClass/Truck_Project1/PIC24_support/esos1/Truck_App.h
	static int acc, fuel_pump, fan;
	static ESOS_TASK_HANDLE fpga_handle;
	
	comm1_handle = esos_GetTaskHandle(send_comm1);
	fpga_handle = esos_GetTaskHandle(send_fpga);

    ESOS_TASK_BEGIN();

	acc = fuel_pump = fan = 0;

	while (TRUE)
	{
		ESOS_TASK_WAIT_FOR_MAIL();

		while(ESOS_TASK_IVE_GOT_MAIL())
		{
			data1 = __esos_CB_ReadUINT8(__pstSelf->pst_Mailbox->pst_CBuffer);
			switch(data1)
			{
				case 	KP_1:
					__esos_CB_WriteUINT8(comm1_handle->pst_Mailbox->pst_CBuffer,ENABLE_START);
				break;

				case	KP_2:
					if(acc == 0)
					{
						__esos_CB_WriteUINT8(comm1_handle->pst_Mailbox->pst_CBuffer,ON_ACC);
						acc = 1;
					}
					else{
						__esos_CB_WriteUINT8(comm1_handle->pst_Mailbox->pst_CBuffer,OFF_ACC);
						acc = 0;
					}
				break;

				case	KP_3:
					if(fuel_pump == 0)
					{
						__esos_CB_WriteUINT8(comm1_handle->pst_Mailbox->pst_CBuffer,ON_FUEL_PUMP);
						fuel_pump = 1;
					}
					else{
						__esos_CB_WriteUINT8(comm1_handle->pst_Mailbox->pst_CBuffer,OFF_FUEL_PUMP);
						fuel_pump = 0;
					}
				break;

				case	KP_4:
					if(fan == 0)
					{
						__esos_CB_WriteUINT8(comm1_handle->pst_Mailbox->pst_CBuffer,ON_FAN);
						fan = 1;
					}
					else{
						__esos_CB_WriteUINT8(comm1_handle->pst_Mailbox->pst_CBuffer,OFF_FAN);
						fan = 0;
					}
				break;

				case	KP_5:
					__esos_CB_WriteUINT8(comm1_handle->pst_Mailbox->pst_CBuffer,START_SEQ);
				break;

				case	KP_6:
					__esos_CB_WriteUINT8(comm1_handle->pst_Mailbox->pst_CBuffer,SHUTDOWN);
/*
					avr_buffer[0] = SEND_INT_RT_VALUES;
					avr_buffer[1] = rtlabel_str[0].row;
					avr_buffer[2] = rtlabel_str[0].col + 15;
					avr_buffer[3] = 
					avr_buffer[4] = 
					AVR_CALL();
*/
				break;

				case	KP_7:
				break;

				case	KP_8:
				break;

				case	KP_9:
				break;

				case	KP_A:		// move up in menu
					if(menu_ptr < 1)
						menu_ptr = NUM_MENU_LABELS;
					menu_ptr--;	

					avr_buffer[0] = SET_MODE_CMD;
					avr_buffer[1] = TEXT_ON | CURSOR_BLINK_ON;
					avr_buffer[2] = menu_str[menu_ptr].row;
					avr_buffer[3] = menu_str[menu_ptr].col-2;
					avr_buffer[4] = (LINE_8_CURSOR);
					AVR_CALL();
				break;

				case	KP_B:		// move down in menu
					if(++menu_ptr > NUM_MENU_LABELS - 1)
						menu_ptr = 0;

					avr_buffer[0] = SET_MODE_CMD;
					avr_buffer[1] = TEXT_ON | CURSOR_BLINK_ON;
					avr_buffer[2] = menu_str[menu_ptr].row;
					avr_buffer[3] = menu_str[menu_ptr].col-2;
					avr_buffer[4] = (LINE_8_CURSOR);
					AVR_CALL();
				break;

				case	KP_C:

//					__esos_CB_WriteUINT8(comm1_handle->pst_Mailbox->pst_CBuffer,
//						(menu_ptr+1)*2+menu_str[menu_ptr].onoff);
				break;

				case	KP_D:		// exec menu choice
					avr_buffer[0] = GOTO_CMD;
					avr_buffer[1] = menu_str[menu_ptr].row;
					avr_buffer[2] = menu_str[menu_ptr].col-2;
					AVR_CALL();

					if(menu_str[menu_ptr].onoff == 1)
						menu_str[menu_ptr].onoff = 0;
					else menu_str[menu_ptr].onoff = 1;
					avr_buffer[0] = CHAR_CMD;
					avr_buffer[1] = (menu_str[menu_ptr].onoff?'X':' ');
					AVR_CALL();
				break;

				case	KP_POUND:

					data4 = FPGA_LCD_PWM;
					data4 <<= 8;
					data3 &= 0xFF00;
					data4 |= PWM_80DC_PARAM;
					__esos_CB_WriteUINT16(fpga_handle->pst_Mailbox->pst_CBuffer,data4);

				break;

				case	KP_AST:

					data4 = FPGA_LCD_PWM;
					data4 <<= 8;
					data3 &= 0xFF00;
					data4 |= PWM_75DC_PARAM;
					__esos_CB_WriteUINT16(fpga_handle->pst_Mailbox->pst_CBuffer,data4);

				break;

				case	KP_0:

					data4 = FPGA_LCD_PWM;
					data4 <<= 8;
					data3 &= 0xFF00;
					data4 |= PWM_ON_PARAM;
					__esos_CB_WriteUINT16(fpga_handle->pst_Mailbox->pst_CBuffer,data4);

				break;

				default:
				break;
			}

/*
			avr_buffer[0] = GOTO_CMD;
			avr_buffer[1] = 0;
			avr_buffer[2] = 0;
			AVR_CALL();

			avr_buffer[0] = CHAR_CMD;
			if(data1 >= KP_1 && data1 <= KP_9)
				avr_buffer[1] = data1 + 0x30-KP_1;
			else if(data1 >= KP_A && data1 <= KP_D)
				avr_buffer[1] = data1 + 0xE8-KP_A;
			else avr_buffer[1] = data1 + KP_1;	
			AVR_CALL();
*/
		}
	}
    ESOS_TASK_END();
}

//******************************************************************************************//
//************************************* password_task **************************************//
//******************************************************************************************//
volatile ESOS_TASK_HANDLE password_task_handle;

ESOS_USER_TASK(password_task)
{
	static UCHAR data1, temp;
	static ESOS_TASK_HANDLE comm1_handle;
    static ESOS_TASK_HANDLE menu_handle;
    static ESOS_TASK_HANDLE rt_handle;
    static int i;

    ESOS_TASK_BEGIN();
    password_task_handle = ESOS_TASK_GET_TASK_HANDLE();
	comm1_handle = esos_GetTaskHandle(send_comm1);
	menu_handle = esos_GetTaskHandle(display_menu);
	rt_handle = esos_GetTaskHandle(display_rtlabels);
    
	ESOS_TASK_WAIT_TICKS(1000);

/*
	avr_buffer[0] = GOTO_CMD;
	avr_buffer[1] = 7;
	avr_buffer[2] = (UCHAR)strlen(correct_password);
	AVR_CALL();

	avr_buffer[0] = CHAR_CMD;
	avr_buffer[1] = 7;
	avr_buffer[2] = '<';
	AVR_CALL();
*/
	avr_buffer[0] = EEPROM_STR;
	avr_buffer[1] = 6;	// row 6
	avr_buffer[2] = 0;	// col 0
	avr_buffer[3] = VARIOUS_MSG_OFFSET;	//  ("enter password")
	avr_buffer[4] = 10;
	AVR_CALL();

	avr_buffer[0] = SET_MODE_CMD;
	avr_buffer[1] = TEXT_ON | CURSOR_BLINK_ON;
	avr_buffer[2] = 7;
	avr_buffer[3] = 0;
	avr_buffer[4] = (LINE_1_CURSOR);
	AVR_CALL();

	temp = 0;
	while (TRUE)
	{
		ESOS_TASK_WAIT_FOR_MAIL();

		while(ESOS_TASK_IVE_GOT_MAIL())
		{
			data1 = __esos_CB_ReadUINT8(__pstSelf->pst_Mailbox->pst_CBuffer);
			switch(data1)
			{
				case	KP_0:
				case 	KP_1:
				case	KP_2:
				case	KP_3:
				case	KP_4:
				case	KP_5:
				case	KP_6:
				case	KP_7:
				case	KP_8:
				case	KP_9:
					data1 = data1 - KP_1 + 0x31;
					password[password_ptr] = data1;
					avr_buffer[0] = CHAR_CMD;
					avr_buffer[1] = '*';
					AVR_CALL();
					avr_buffer[0] = SET_MODE_CMD;
					avr_buffer[1] = TEXT_ON | CURSOR_BLINK_ON;
					avr_buffer[2] = 7;
					avr_buffer[3] = password_ptr+1;
					avr_buffer[4] = (LINE_1_CURSOR);
					AVR_CALL();
				break;

				case	KP_A:
/*
					i = 0;
					while(password[i] != 0 && correct_password[i] != 0 &&
													 password[i] == correct_password[i])
					{
						i++;
					}
					if(i > PASSWORD_SIZE)
						temp == 2;
					else if(password[i] == correct_password[i])
						temp = 3;
*/
					break;

				case	KP_B:
					password_ptr--;
					avr_buffer[0] = SET_MODE_CMD;
					avr_buffer[1] = TEXT_ON | CURSOR_BLINK_ON;
					avr_buffer[2] = 7;
					avr_buffer[3] = password_ptr;
					avr_buffer[4] = (LINE_1_CURSOR);
					AVR_CALL();
					break;

