EmbeddedSystemClass/Truck_Project1/PIC24_support/esos1/Truck_App.h
	fpga_handle = esos_GetTaskHandle(send_fpga);

    ESOS_TASK_BEGIN();
    data2 = 0;
    data1 = 0;
	while(TRUE)
	{
		ESOS_TASK_WAIT_TICKS(2);
		switch (e_isrState)
		{
			case STATE_WAIT_FOR_PRESS:
				if (KEY_PRESSED() && (u8_newKey == 0))
				{
	//ensure that key is sampled low for two consecutive interrupt periods
					e_isrState = STATE_WAIT_FOR_PRESS2;
				}
				break;
			case STATE_WAIT_FOR_PRESS2:
				if (KEY_PRESSED())
				{
	// a key is ready
					u8_newKey = doKeyScan();
					e_isrState = STATE_WAIT_FOR_RELEASE;
// send the message to FPGA to turn on DTMF tone

					data1 = FPGA_DTMF_TONE_ON;
					data1 <<= 8;
					data1 &= 0xFF00;

					data1 |= u8_newKey - 0xE0;

					__esos_CB_WriteUINT16(fpga_handle->pst_Mailbox->pst_CBuffer,data1);


				} else e_isrState = STATE_WAIT_FOR_PRESS;
				break;

			case STATE_WAIT_FOR_RELEASE:
	//keypad released
				if (KEY_RELEASED())
				{
					ESOS_SIGNAL_SEMAPHORE(key_sem,1);
					e_isrState = STATE_WAIT_FOR_PRESS;
// send the message to FPGA to turn on DTMF tone

					data1 = FPGA_DTMF_TONE_OFF;
					data1 <<= 8;
					data1 &= 0xFF00;

					__esos_CB_WriteUINT16(fpga_handle->pst_Mailbox->pst_CBuffer,data1);

				}
				break;
			default:
				e_isrState = STATE_WAIT_FOR_PRESS;
				break;
		}
	}
	ESOS_TASK_END();
}

//******************************************************************************************//
//************************************ key_timer_task **************************************//
//******************************************************************************************//
ESOS_USER_TASK(key_timer_task)
{
	static UCHAR data3, data2;
	static UINT data1;

	static ESOS_TASK_HANDLE fpga_handle;

	avr_handle = esos_GetTaskHandle(AVR_cmd);
	fpga_handle = esos_GetTaskHandle(send_fpga);

    ESOS_TASK_BEGIN();

    key_enter_time = 0;

	data2 = 0;
	while (TRUE)
	{

		ESOS_TASK_WAIT_TICKS(1000);
/*
		avr_buffer[0] = SEND_INT_RT_VALUES;
		avr_buffer[1] = rtlabel_str[RPM].row;
		avr_buffer[2] = rtlabel_str[RPM].data_col;
		avr_buffer[3] = (UCHAR)(rpm >> 8);
		avr_buffer[4] = (UCHAR)rpm;
		AVR_CALL();

		avr_buffer[0] = SEND_INT_RT_VALUES;
		avr_buffer[1] = rtlabel_str[RPM].row;
		avr_buffer[2] = rtlabel_str[RPM].data_col;
		avr_buffer[3] = (UCHAR)(mph >> 8);
		avr_buffer[4] = (UCHAR)mph;
		AVR_CALL();
*/
		

/*
			if(++data2 > 5)
			{
				data2 = 0;
				data1 = FPGA_DTMF_TONE_OFF;
				data1 <<= 8;
				data1 &= 0xFF00;
			}
			else
			{
				data1 = FPGA_DTMF_TONE_ON;
				data1 <<= 8;
				data1 &= 0xFF00;
				data1 |= (UINT)data2;
			}
			
			__esos_CB_WriteUINT16(fpga_handle->pst_Mailbox->pst_CBuffer,data1);


		if(key_enter_time > 5)
		{
			data3 = FPGA_LCD_PWM;
			data3 <<= 8;
			data3 &= 0xFF00;
			data3 |= PWM_80DC_PARAM;
			__esos_CB_WriteUINT16(fpga_handle->pst_Mailbox->pst_CBuffer,data3);
		}
		if(key_enter_time > 10)
		{
			data3 = FPGA_LCD_PWM;
			data3 <<= 8;
			data3 &= 0xFF00;
			data3 |= PWM_75DC_PARAM;
			__esos_CB_WriteUINT16(fpga_handle->pst_Mailbox->pst_CBuffer,data3);
		}
		if(key_enter_time > 15)
		{
			data3 = FPGA_LCD_PWM;
			data3 <<= 8;
			data3 &= 0xFF00;
			data3 |= PWM_50DC_PARAM;
			__esos_CB_WriteUINT16(fpga_handle->pst_Mailbox->pst_CBuffer,data3);
		}
*/
		key_enter_time++;
	}
    ESOS_TASK_END();
}
//******************************************************************************************//
//************************************** poll_keypad ***************************************//
//******************************************************************************************//
ESOS_USER_TASK(poll_keypad)
{

    static ESOS_TASK_HANDLE menu_handle;
    static ESOS_TASK_HANDLE password_handle;
    static ESOS_TASK_HANDLE numentry_handle;
	static ESOS_TASK_HANDLE fpga_handle;
	static UCHAR data3;

    ESOS_TASK_BEGIN();

	menu_handle = esos_GetTaskHandle(menu_task);
	password_handle = esos_GetTaskHandle(password_task);
	numentry_handle = esos_GetTaskHandle(numentry_task);
	fpga_handle = esos_GetTaskHandle(send_fpga);

	configKeypad();
	while (TRUE)
	{
		ESOS_TASK_WAIT_SEMAPHORE(key_sem,1);
		if(u8_newKey)
		{
			switch(key_mode)
			{
				case NORMAL:
					__esos_CB_WriteUINT8(menu_handle->pst_Mailbox->pst_CBuffer,u8_newKey);
					break;
				case PASSWORD:
					__esos_CB_WriteUINT8(password_handle->pst_Mailbox->pst_CBuffer,u8_newKey);
					break;
				case NUMENTRY:
					__esos_CB_WriteUINT8(numentry_handle->pst_Mailbox->pst_CBuffer,u8_newKey);
					break;
				default:
					break;
			}
			u8_newKey = 0;	// very important to reset this to 0
			// if key_enter_time has dimmed screen then
			// turn it back on
/*
			if(key_enter_time > 3)
			{
				data3 = FPGA_LCD_PWM;
				data3 <<= 8;
				data3 &= 0xFF00;
				data3 |= PWM_ON_PARAM;
				__esos_CB_WriteUINT16(fpga_handle->pst_Mailbox->pst_CBuffer,data3);
			}
*/
			key_enter_time = 0;
		}
	}
    ESOS_TASK_END();
}
//******************************************************************************************//
//********************************** CONFIG_SPI_SLAVE **************************************//
//******************************************************************************************//
#if 0
static void CONFIG_SPI_SLAVE(void)
{
  SPI1CON1 = SEC_PRESCAL_8_1		|		//8:1 secondary prescale
             PRI_PRESCAL_64_1		|		//64:1 primary prescale
             CLK_POL_ACTIVE_HIGH	|		//clock active high (CKP = 0)
             SPI_CKE_ON				|		//out changes active to idle (CKE=1)
             SPI_MODE8_ON			|		//8-bit mode
//             SPI_SMP_ON				|		// input data sampled at end of data output time
             SLAVE_ENABLE_ON;				//master mode

	CONFIG_SDI1_TO_RP(RD14_RP);
	CONFIG_RD14_AS_DIG_INPUT();
	CONFIG_SDO1_TO_RP(RD15_RP);
	CONFIG_RD15_AS_DIG_OUTPUT();
	CONFIG_SCK1IN_TO_RP(RF4_RP);
	CONFIG_RF4_AS_DIG_INPUT();
	CONFIG_SS1IN_TO_RP(RF5_RP);
	CONFIG_RF5_AS_DIG_INPUT();
	SPI1STATbits.SPIEN = 1;  //enable SPI mode
}
volatile uint8_t  cmd_array[24] = {0x80, 0x81, 0x82, 0x83, 0x84, 0x85, 0x86, 0x87, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15};
//******************************************************************************************//
//**************************************** echo_spi ****************************************//
//******************************************************************************************//
ESOS_USER_TASK(spi_task)
{
	static uint8_t data1;
//	static uint8_t data2;
	static uint8_t cmd;
	static uint8_t i;

//	static char rpm_disp[5];
//	static char mph_disp[5];
//	static uint16_t res;
	static uint8_t res2;
//	static uint16_t res3, res4;
//	static char res_str[10];
//	static char res2_str[10];

